cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'phinze/homebrew-cask'

brew 'caskroom/cask/brew-cask'
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'nvm'
brew 'readline'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'

cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'handbrake'
cask 'slack'
cask 'transmission'
cask 'tunnelbear'
cask 'vlc'
cask 'suspicious-package'
cask 'quicklook-json'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlcolorcode'
