cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'

brew 'ack'
brew 'colordiff'
brew 'coreutils'
# replace mac builtins with gnu implementations
brew 'gnu-sed'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'nvm'
brew 'readline'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'socat'
brew 'git-lfs'
brew 'direnv'
brew 'starship'
brew 'gnupg'
brew 'gnupg2'

cask 'visual-studio-code'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'homebrew/cask-fonts/font-fira-code'
cask 'homebrew/cask-fonts/font-hack'
cask 'handbrake'
cask 'slack'
cask 'transmission'
cask 'tunnelbear'
cask 'vlc'
cask 'suspicious-package'
# quick look plugins for mac os finder
cask 'quicklook-json'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlcolorcode'
