cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'colordiff'
brew 'coreutils'
# replace mac builtins with gnu implementations
brew 'gnu-sed'
brew 'libgit2'
brew 'git-lfs'
brew 'openssl'
brew 'nvm'
brew 'readline'
brew 'postgresql'
brew 'wget'
brew 'socat'
brew 'direnv'
brew 'gnupg'
brew 'pyenv'
brew 'pyenv-virtualenv'

cask 'visual-studio-code'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'homebrew/cask-fonts/font-fira-code-nerd-font'
cask 'homebrew/cask-fonts/font-hack-nerd-font'
cask 'handbrake'
cask 'slack'
cask 'transmission'
cask 'tunnelbear'
cask 'vlc'
